app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES (?, ?, ?, ?, ?, ?)  [["title", "TID"], ["created_at", "2025-09-10 03:38:09.899409"], ["updated_at", "2025-09-10 03:38:09.899409"], ["author", "Cassandra Clare"], ["price", 50.0], ["published_date", "2025-09-10"]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ?, "author" = ?, "price" = ?, "published_date" = ? WHERE "books"."id" = ?  [["updated_at", "2025-09-10 03:43:02.705275"], ["author", "J. K. Rowling"], ["price", 25.0], ["published_date", "2020-01-01"], ["id", 1]]